       >>SOURCE FORMAT FREE
       identification division.
       program-id. Data-Classification.
       author. Ashok.
       date-written. Jun 24 2026.
       environment division.
       
       data division.
       file section.
       working-storage section.
       
       procedure division.
       display "Hello world"
           stop run.